---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.ElementFailures
source: html/efa812cc-5762-0a0c-3c84-6b777337bf71.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElementFailures

Failures about Elements.

## Syntax (C#)
```csharp
public static class ElementFailures
```